#include <iostream>
using namespace std;
int main() {
	////For 1 Дано целое положительное число n.
	//Вывести n раз символ &
	/*int n;
	cin >> n;
	for (int i = 1; i <= n; i += 1) {
		cout << '&';
	}*/
	//While 1 Дано 2 целых положительных числа a и b
	// (a < b). Вывести из этого диапазона все числа
	//в порядке убывания 
	/*int a, b, i;
	cin >> a >> b;
	i = b;
	while (i >= a) {
		cout << i << ' ';
		i -= 1;
	}*/
	//For 2. Вывести только четные числа из диапазона 20-30. If не использовать
	//While 2  Дано 2 целых положительных числа a и b (a < b). Найти сумму четных чисел из этого диапазона
	//For 3. Дано целое положительное число n.
	//Найти произведение натуральных чисел 
	//не больших n и не делящихся на 5 
	//(не кратных 5)
	//While 3 Дано натуральное n. вычислить: 1 + 1/2 + 1/3 + 1/4 + ... + 1/n.


}