#include <iostream>
using namespace std;
int main() {
	//Дан массив целых чисел размером 5. Ввести в него данные и вывести данные на экран в одну строку.
	/*const int size = 5;
	int mas[size];
	//ввод
	for (int i = 0; i < size; i++) {
		cin >> mas[i];
	}
	//вывод
	for (int i = 0; i < size; i++) {
		cout << mas[i] << ' ';
	}*/
	//Дан массив целых чисел (положительных и отрицательных) размером 10. Ввести данные в массив, вывести в одну строку. Найти кол-во положительных чисел в массиве.
	/*const int size = 10;
	int arr[size];
	//ввод
	for (int i = 0; i < size; i++) {
		cin >> arr[i];
	}
	//вывод
	for (int i = 0; i < size; i++) {
		cout << arr[i] << ' ';
	}
	cout << endl;
	//подсчет кол-ва положительных
	int k = 0;
	for (int i = 0; i < size; i++) {
		if (arr[i] > 0) k++;
	}
	cout << ">0" << k << endl;
	*/
	//1 Дан массив целых чисел (положительных и отрицательных) размером 10. Ввести данные в массив, вывести в одну строку В ОБРАТНОМ ПОРЯДКЕ (от последнего номера к первому)
	//2 Дан массив целых чисел (положительных и отрицательных) размером 8. Ввести данные в массив, вывести в одну строку. Найти сумму четных элементов
	//3 Дан массив целых чисел (положительных и отрицательных) размером 5. Ввести данные в массив, вывести в одну строку. Найти произведение элементов с ЧЕТНЫМИ НОМЕРАМИ (0, 2 и т.д.)
	//4 Дан массив целых чисел (положительных и отрицательных) размером 7. Ввести данные в массив, вывести в одну строку. Найти кол-во элементов, которые одновременно не делятся на 3 И делятся на 5 .
	//5 Дан массив целых чисел (положительных и отрицательных) размером 9. Ввести данные в массив, вывести в одну строку. Найти среднее арифметическое нечетных элементов.
}